services/service-a/jmeter/scenarios/attack_write_vs_normal.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>

    <!-- ================= Test Plan ================= -->
    <TestPlan guiclass="TestPlanGui"
              testclass="TestPlan"
              testname="attack_write_vs_normal"
              enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>

      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">${__P(BASE_URL,host.docker.internal)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>

    <hashTree>

      <!-- ================= HTTP Defaults ================= -->
      <ConfigTestElement guiclass="HttpDefaultsGui"
                         testclass="ConfigTestElement"
                         testname="HTTP Request Defaults"
                         enabled="true">
        <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
        <stringProp name="HTTPSampler.port">8080</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
      </ConfigTestElement>
      <hashTree/>

      <!-- ================= Attack Thread Group ================= -->
      <ThreadGroup guiclass="ThreadGroupGui"
                   testclass="ThreadGroup"
                   testname="Attack-TG"
                   enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>

        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${__P(ATTACK_LOOPS,50)}</stringProp>
        </elementProp>

        <!-- 공격자 동시성 -->
        <stringProp name="ThreadGroup.num_threads">${__P(ATTACK_THREADS,45)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(ATTACK_RAMP,30)}</stringProp>
      </ThreadGroup>

      <hashTree>

        <!-- Attack Headers -->
        <HeaderManager guiclass="HeaderPanel"
                       testclass="HeaderManager"
                       testname="Attack Headers"
                       enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">X-Forwarded-For</stringProp>
              <stringProp name="Header.value">10.10.10.10</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <!-- Attack User Pace (WRITE는 반드시 필요) -->
        <ConstantTimer guiclass="ConstantTimerGui"
                       testclass="ConstantTimer"
                       testname="Attack User Delay"
                       enabled="true">
          <stringProp name="ConstantTimer.delay">${__P(ATTACK_DELAY,250)}</stringProp>
        </ConstantTimer>
        <hashTree/>

        <!-- Attack HTTP Request (DB WRITE) -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui"
                          testclass="HTTPSamplerProxy"
                          testname="Attack DB Write"
                          enabled="true">
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <stringProp name="HTTPSampler.path">/api/load/db-write</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>

          <elementProp name="HTTPSampler.arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="repeatCount" elementType="Argument">
                <stringProp name="Argument.name">repeatCount</stringProp>
                <stringProp name="Argument.value">${__P(ATTACK_REPEAT,1)}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>

        <hashTree/>
      </hashTree>

      <!-- ================= Normal Thread Group ================= -->
      <ThreadGroup guiclass="ThreadGroupGui"
                   testclass="ThreadGroup"
                   testname="Normal-TG"
                   enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>

        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${__P(NORMAL_LOOPS,50)}</stringProp>
        </elementProp>

        <!-- 정상 사용자 -->
        <stringProp name="ThreadGroup.num_threads">${__P(NORMAL_THREADS,3)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
      </ThreadGroup>

      <hashTree>

        <!-- Normal Headers -->
        <HeaderManager guiclass="HeaderPanel"
                       testclass="HeaderManager"
                       testname="Normal Headers"
                       enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">X-Forwarded-For</stringProp>
              <stringProp name="Header.value">20.20.20.20</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <!-- Normal User Pace -->
        <ConstantTimer guiclass="ConstantTimerGui"
                       testclass="ConstantTimer"
                       testname="Normal User Delay"
                       enabled="true">
          <stringProp name="ConstantTimer.delay">${__P(NORMAL_DELAY,1000)}</stringProp>
        </ConstantTimer>
        <hashTree/>

        <!-- Normal HTTP Request (DB WRITE) -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui"
                          testclass="HTTPSamplerProxy"
                          testname="Normal DB Write"
                          enabled="true">
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <stringProp name="HTTPSampler.path">/api/load/db-write</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>

          <elementProp name="HTTPSampler.arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="repeatCount" elementType="Argument">
                <stringProp name="Argument.name">repeatCount</stringProp>
                <stringProp name="Argument.value">${__P(NORMAL_REPEAT,1)}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>

        <hashTree/>
      </hashTree>

    </hashTree>
  </hashTree>
</jmeterTestPlan>